{"organizations": [], "uuid": "da1e78e829cc34d67cef86ef80ec1cadbd394349", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/04/03/105106397-GettyImages-628052786.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/04/03/nba-star-andre-iguodala-says-his-locker-room-talk-is-all-business.html", "country": "US", "domain_rank": 767, "title": "NBA star Andre Iguodala says his team's 'locker room talk' is all business", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-04-03T21:40:00.000+03:00", "replies_count": 0, "uuid": "da1e78e829cc34d67cef86ef80ec1cadbd394349"}, "author": "", "url": "https://www.cnbc.com/2018/04/03/nba-star-andre-iguodala-says-his-locker-room-talk-is-all-business.html", "ord_in_thread": 0, "title": "NBA star Andre Iguodala says his team's 'locker room talk' is all business", "locations": [], "entities": {"persons": [{"name": "draymond green", "sentiment": "negative"}, {"name": "javale mcgee", "sentiment": "negative"}, {"name": "stephen curry", "sentiment": "negative"}, {"name": "andre iguodala", "sentiment": "negative"}, {"name": "kevin durant", "sentiment": "negative"}, {"name": "rudy cline-thomas", "sentiment": "none"}, {"name": "iguodala", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}, {"name": "andre", "sentiment": "none"}, {"name": "andreessen horowitz", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "nba", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], 
"text": "If you walk into the Golden State Warriors locker room, be prepared to talk business.\n\"We have free agents come to our team, and the first day the guy is walking in like, 'What do you know about this business?'\" Warriors star Andre Iguodala tells online investing service Wealthsimple . \"That's our locker room talk.\"\nThe team plays just across the bay from San Francisco and the players, including Iguodala, take advantage of their proximity to Silicon Valley. \"We have some great relationships with VCs out there, mainly Andreessen Horowitz,\" Iguodala tells CNBC . \"They've kind of taken me under their wing and ... showed me some things in the portfolio and how I can integrate my brand into some of their brands.\"\nHe and his business partner Rudy Cline-Thomas started investing in tech stocks about 10 years ago. They started out with big names like Facebook, Twitter and Tesla. Today, the business partners have invested in at least 25 start-ups.\n\"Andre and I meet every two weeks,\" Cline-Thomas tells Wealthsimple. \"We visit new companies. ... He'll send articles every day, interesting information, tidbits on the marketplace.\"\nshow chapters Stephen Curry, LeBron James and other NBA champs are investing in start-ups      1:30 PM ET Tue, 1 Aug 2017 | 01:09 Kevin Durant, another Golden State Warrior, says he's following Iguodala's example. Durant has been known to hang out with Silicon Valley's A-list and \"is laying the foundation for a tech empire of his own,\" The New York Times reports .\nAccording to the Times, Durant's portfolio includes investments \"in tech companies like Postmates and Acorns , in addition to hotels and restaurants and film and television development.\" And, like Iguodala, he's an investor in The Players' Tribune.\n\"A number of my Warriors teammates — Steph Curry, Draymond Green, Javale McGee — are into investing and tech,\" Iguodala tells Wealthsimple. \"But we never look at it as a competition. We inform each other of what's going on.\"\nThe collaboration works, he says: \"I learn something from all of those guys. Steph was having a conversation about net neutrality one day, and I wasn't as caught up on it. He got started on it, and I was locked in, because he did his homework!\"\nIguodala hopes the interest in investing spreads to other NBA teams. \"I've been able to meet interesting people who have helped me. And, in turn, I want to help out my fellow NBA players,\" he tells CNBC .\nThat is part of the reason why he leads an annual Players Technology Summit , the goal of which is to \"give our players many options post-retirement,\" says Iguodala, \"because there's many, many years of life when you're not playing.\"\nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: NBA star Andre Iguodala shares how he spent his first big paycheck \n\nshow chapters Here's how NBA star Draymond Green plans to be a billionaire by 40      10:36 AM ET Fri, 14 July 2017 | 01:01", "external_links": [], "published": "2018-04-03T21:40:00.000+03:00", "crawled": "2018-04-03T21:59:38.036+03:00", "highlightTitle": ""}